<a href="https://colab.research.google.com/github/HwangHanJae/datascience-basic-tect/blob/main/pandas_10minutes_tutorial.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas Tutorial
- 10 minutes to pandas

# 라이브러리 로드

In [1]:
import numpy as np
import pandas as pd

# 객체 생성

value의 리스트를 전달하여 Series 타입을 생성하고 pandas의 기본 인덱스를 적용합니다.

In [2]:
#Input
s = pd.Series([1,3,5, np.nan, 6,8])
#Output
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

datatime 타입과 레이블이있는 column과 Numpy array를 전달하여 Dataframe을 생성합니다.

In [3]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01  2.180646 -0.561483 -0.482398 -0.031328
2013-01-02  0.922567  0.300391  1.469307  1.357893
2013-01-03  1.642482  1.039809  1.026084 -0.078637
2013-01-04 -0.319732  0.618421  0.860000  0.476383
2013-01-05 -0.118017 -0.593080  1.106194  0.196017
2013-01-06  2.468270  0.091436 -1.721132  1.221244

Series 타입처럼 변환할수 있는 객체의 dict 타입을 전달하여 DataFrame을 생성합니다.

In [5]:
df2 = pd.DataFrame(
    {"A" : 1.0,
    "B" : pd.Timestamp("20130102"),
    "C" : pd.Series(1, index=list(range(4)), dtype="float32"),
    "D" : np.array([3] *4, dtype="int32"),
    "E" : pd.Categorical(["test","train","test","train"]),
    "F" : 'foo',}
)

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

Dataframe의 columns 들은 다른 dtypes를 가지고 있습니다.

In [6]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

# 데이터 관찰

데이터 프레임의 상단, 하단을 보는 방법입니다.

In [7]:
df.head()

                   A         B         C         D
2013-01-01  2.180646 -0.561483 -0.482398 -0.031328
2013-01-02  0.922567  0.300391  1.469307  1.357893
2013-01-03  1.642482  1.039809  1.026084 -0.078637
2013-01-04 -0.319732  0.618421  0.860000  0.476383
2013-01-05 -0.118017 -0.593080  1.106194  0.196017

In [8]:
df.tail()

                   A         B         C         D
2013-01-02  0.922567  0.300391  1.469307  1.357893
2013-01-03  1.642482  1.039809  1.026084 -0.078637
2013-01-04 -0.319732  0.618421  0.860000  0.476383
2013-01-05 -0.118017 -0.593080  1.106194  0.196017
2013-01-06  2.468270  0.091436 -1.721132  1.221244

index, columns를 표현합니다.

In [9]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

DataFrame.to_numpy()는 NumPy 표현을 제공합니다.

In [11]:
df

                   A         B         C         D
2013-01-01  2.180646 -0.561483 -0.482398 -0.031328
2013-01-02  0.922567  0.300391  1.469307  1.357893
2013-01-03  1.642482  1.039809  1.026084 -0.078637
2013-01-04 -0.319732  0.618421  0.860000  0.476383
2013-01-05 -0.118017 -0.593080  1.106194  0.196017
2013-01-06  2.468270  0.091436 -1.721132  1.221244

In [12]:
df.to_numpy()

array([[ 2.18064564, -0.56148288, -0.48239816, -0.03132785],
       [ 0.92256655,  0.30039115,  1.46930689,  1.35789346],
       [ 1.64248219,  1.03980894,  1.02608445, -0.07863701],
       [-0.31973165,  0.61842115,  0.86000001,  0.47638322],
       [-0.11801748, -0.59308003,  1.1061939 ,  0.19601741],
       [ 2.46826987,  0.09143561, -1.72113154,  1.22124427]])

In [13]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [14]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

DataFrame.to_numpy()는 index와 columns를 포함하지 않습니다.

Data를 T(transpose)합니다.

In [15]:
df

                   A         B         C         D
2013-01-01  2.180646 -0.561483 -0.482398 -0.031328
2013-01-02  0.922567  0.300391  1.469307  1.357893
2013-01-03  1.642482  1.039809  1.026084 -0.078637
2013-01-04 -0.319732  0.618421  0.860000  0.476383
2013-01-05 -0.118017 -0.593080  1.106194  0.196017
2013-01-06  2.468270  0.091436 -1.721132  1.221244

In [16]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    2.180646    0.922567    1.642482   -0.319732   -0.118017    2.468270
B   -0.561483    0.300391    1.039809    0.618421   -0.593080    0.091436
C   -0.482398    1.469307    1.026084    0.860000    1.106194   -1.721132
D   -0.031328    1.357893   -0.078637    0.476383    0.196017    1.221244

axis=1(열)을 기준으로 정렬합니다.

In [17]:
df

                   A         B         C         D
2013-01-01  2.180646 -0.561483 -0.482398 -0.031328
2013-01-02  0.922567  0.300391  1.469307  1.357893
2013-01-03  1.642482  1.039809  1.026084 -0.078637
2013-01-04 -0.319732  0.618421  0.860000  0.476383
2013-01-05 -0.118017 -0.593080  1.106194  0.196017
2013-01-06  2.468270  0.091436 -1.721132  1.221244

In [18]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.031328 -0.482398 -0.561483  2.180646
2013-01-02  1.357893  1.469307  0.300391  0.922567
2013-01-03 -0.078637  1.026084  1.039809  1.642482
2013-01-04  0.476383  0.860000  0.618421 -0.319732
2013-01-05  0.196017  1.106194 -0.593080 -0.118017
2013-01-06  1.221244 -1.721132  0.091436  2.468270

values를 기준으로 정렬합니다.

기본적으로 오름차순이 적용됩니다. ascending = True

In [19]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-05 -0.118017 -0.593080  1.106194  0.196017
2013-01-01  2.180646 -0.561483 -0.482398 -0.031328
2013-01-06  2.468270  0.091436 -1.721132  1.221244
2013-01-02  0.922567  0.300391  1.469307  1.357893
2013-01-04 -0.319732  0.618421  0.860000  0.476383
2013-01-03  1.642482  1.039809  1.026084 -0.078637

# 가져오기

single column을 선택하면 Series 가 생성이 됩니다.

df.A와 기능이 동등합니다.

In [20]:
df["A"]

2013-01-01    2.180646
2013-01-02    0.922567
2013-01-03    1.642482
2013-01-04   -0.319732
2013-01-05   -0.118017
2013-01-06    2.468270
Freq: D, Name: A, dtype: float64

[]을 사용하면 행을 분할(슬라이싱) 합니다.

In [21]:
df[0:3]

                   A         B         C         D
2013-01-01  2.180646 -0.561483 -0.482398 -0.031328
2013-01-02  0.922567  0.300391  1.469307  1.357893
2013-01-03  1.642482  1.039809  1.026084 -0.078637

In [22]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02  0.922567  0.300391  1.469307  1.357893
2013-01-03  1.642482  1.039809  1.026084 -0.078637
2013-01-04 -0.319732  0.618421  0.860000  0.476383

# 레이블별 선택

레이블을 사용하여 가져오기

In [23]:
df.loc[dates[0]]

A    2.180646
B   -0.561483
C   -0.482398
D   -0.031328
Name: 2013-01-01 00:00:00, dtype: float64

컬럼을 다중으로 선택하여 가져오기

In [24]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01  2.180646 -0.561483
2013-01-02  0.922567  0.300391
2013-01-03  1.642482  1.039809
2013-01-04 -0.319732  0.618421
2013-01-05 -0.118017 -0.593080
2013-01-06  2.468270  0.091436

종료지점을 포함한 슬라이싱

In [25]:
df.loc["20130102" : "20130104", ["A","B"]]

                   A         B
2013-01-02  0.922567  0.300391
2013-01-03  1.642482  1.039809
2013-01-04 -0.319732  0.618421

객체가 반환하는 차원이 감소합니다.

In [26]:
df.loc["20130102", ["A","B"]]

A    0.922567
B    0.300391
Name: 2013-01-02 00:00:00, dtype: float64

scalar 값을 가져옵니다

In [27]:
df.loc[dates[0], "A"]

2.1806456378045325

scalar에 빠르게 엑세스하여 가져오는 방법입니다.

In [28]:
# df.at["20130101","A"]
df.at[dates[0],"A"]

2.1806456378045325

# 위치(position)별로 선택

전달된 정수(integers)의 위치를 통해 다음을 선택

In [29]:
df.iloc[3]

A   -0.319732
B    0.618421
C    0.860000
D    0.476383
Name: 2013-01-04 00:00:00, dtype: float64

슬라이싱을 통해 Numpy/Python과 유사하게 작동합니다.

In [30]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.319732  0.618421
2013-01-05 -0.118017 -0.593080

정수 리스트를 통해 표현

In [31]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.922567  1.469307
2013-01-03  1.642482  1.026084
2013-01-05 -0.118017  1.106194

row(행)만 슬라이싱을 합니다.

In [32]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  0.922567  0.300391  1.469307  1.357893
2013-01-03  1.642482  1.039809  1.026084 -0.078637

columns(열)만 슬라이싱 합니다.

In [33]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -0.561483 -0.482398
2013-01-02  0.300391  1.469307
2013-01-03  1.039809  1.026084
2013-01-04  0.618421  0.860000
2013-01-05 -0.593080  1.106194
2013-01-06  0.091436 -1.721132

value(값)로 가져옵니다.

In [34]:
df.iloc[1,1]

0.30039115147053147

scalar를 빠르게 엑세스하여 가져옵니다.

In [35]:
df.iat[1,1]

0.30039115147053147

#Boolean indexing

single column의 value를 통해 선택합니다.

In [36]:
df[df["A"]>0]

                   A         B         C         D
2013-01-01  2.180646 -0.561483 -0.482398 -0.031328
2013-01-02  0.922567  0.300391  1.469307  1.357893
2013-01-03  1.642482  1.039809  1.026084 -0.078637
2013-01-06  2.468270  0.091436 -1.721132  1.221244

In [37]:
df

                   A         B         C         D
2013-01-01  2.180646 -0.561483 -0.482398 -0.031328
2013-01-02  0.922567  0.300391  1.469307  1.357893
2013-01-03  1.642482  1.039809  1.026084 -0.078637
2013-01-04 -0.319732  0.618421  0.860000  0.476383
2013-01-05 -0.118017 -0.593080  1.106194  0.196017
2013-01-06  2.468270  0.091436 -1.721132  1.221244

In [38]:
df[df>0]

                   A         B         C         D
2013-01-01  2.180646       NaN       NaN       NaN
2013-01-02  0.922567  0.300391  1.469307  1.357893
2013-01-03  1.642482  1.039809  1.026084       NaN
2013-01-04       NaN  0.618421  0.860000  0.476383
2013-01-05       NaN       NaN  1.106194  0.196017
2013-01-06  2.468270  0.091436       NaN  1.221244

isin() method를 통해 필터링

In [39]:
df2 = df.copy()
df2['E'] = ["one","one","two","three","four","three"]
df2

                   A         B         C         D      E
2013-01-01  2.180646 -0.561483 -0.482398 -0.031328    one
2013-01-02  0.922567  0.300391  1.469307  1.357893    one
2013-01-03  1.642482  1.039809  1.026084 -0.078637    two
2013-01-04 -0.319732  0.618421  0.860000  0.476383  three
2013-01-05 -0.118017 -0.593080  1.106194  0.196017   four
2013-01-06  2.468270  0.091436 -1.721132  1.221244  three

In [40]:
df2[df2['E'].isin(["two","four"])]

                   A         B         C         D     E
2013-01-03  1.642482  1.039809  1.026084 -0.078637   two
2013-01-05 -0.118017 -0.593080  1.106194  0.196017  four

# Setting

새로운 column을 설정하면 index별로 데이터가 자동으로 정렬됩니다.

In [41]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range("20130102", periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [42]:
df['F'] = s1

In [43]:
df

                   A         B         C         D    F
2013-01-01  2.180646 -0.561483 -0.482398 -0.031328  NaN
2013-01-02  0.922567  0.300391  1.469307  1.357893  1.0
2013-01-03  1.642482  1.039809  1.026084 -0.078637  2.0
2013-01-04 -0.319732  0.618421  0.860000  0.476383  3.0
2013-01-05 -0.118017 -0.593080  1.106194  0.196017  4.0
2013-01-06  2.468270  0.091436 -1.721132  1.221244  5.0

label 별로 value를 설정합니다.

In [44]:
df.at[dates[0], "A"] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000 -0.561483 -0.482398 -0.031328  NaN
2013-01-02  0.922567  0.300391  1.469307  1.357893  1.0
2013-01-03  1.642482  1.039809  1.026084 -0.078637  2.0
2013-01-04 -0.319732  0.618421  0.860000  0.476383  3.0
2013-01-05 -0.118017 -0.593080  1.106194  0.196017  4.0
2013-01-06  2.468270  0.091436 -1.721132  1.221244  5.0

position 별로 value를 설정합니다.

In [45]:
df.iat[0,1] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000 -0.482398 -0.031328  NaN
2013-01-02  0.922567  0.300391  1.469307  1.357893  1.0
2013-01-03  1.642482  1.039809  1.026084 -0.078637  2.0
2013-01-04 -0.319732  0.618421  0.860000  0.476383  3.0
2013-01-05 -0.118017 -0.593080  1.106194  0.196017  4.0
2013-01-06  2.468270  0.091436 -1.721132  1.221244  5.0

NumPy array를 할당하여 설정합니다.

In [46]:
df.loc[:,"D"] = np.array([5] * len(df))
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.482398  5  NaN
2013-01-02  0.922567  0.300391  1.469307  5  1.0
2013-01-03  1.642482  1.039809  1.026084  5  2.0
2013-01-04 -0.319732  0.618421  0.860000  5  3.0
2013-01-05 -0.118017 -0.593080  1.106194  5  4.0
2013-01-06  2.468270  0.091436 -1.721132  5  5.0

In [47]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.482398 -5  NaN
2013-01-02 -0.922567 -0.300391 -1.469307 -5 -1.0
2013-01-03 -1.642482 -1.039809 -1.026084 -5 -2.0
2013-01-04 -0.319732 -0.618421 -0.860000 -5 -3.0
2013-01-05 -0.118017 -0.593080 -1.106194 -5 -4.0
2013-01-06 -2.468270 -0.091436 -1.721132 -5 -5.0

# 결측치

pandas는 주로  np.nan값을 누락 데이터를 나타내기 위하여 사용합니다.

In [48]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns)+["E"])
df1.loc[dates[0] : dates[1], "E"] = 1
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.482398  5  NaN  1.0
2013-01-02  0.922567  0.300391  1.469307  5  1.0  1.0
2013-01-03  1.642482  1.039809  1.026084  5  2.0  NaN
2013-01-04 -0.319732  0.618421  0.860000  5  3.0  NaN

how = 'any' 옵션을 사용하여 결측치를 가지고 있지 않는 데이터를 보여줍니다.

In [49]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02  0.922567  0.300391  1.469307  5  1.0  1.0

결측치를 채우기

In [50]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.482398  5  5.0  1.0
2013-01-02  0.922567  0.300391  1.469307  5  1.0  1.0
2013-01-03  1.642482  1.039809  1.026084  5  2.0  5.0
2013-01-04 -0.319732  0.618421  0.860000  5  3.0  5.0

nan값을 가진 value를 boolean mask로 가져옵니다.

In [51]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.482398  5  NaN  1.0
2013-01-02  0.922567  0.300391  1.469307  5  1.0  1.0
2013-01-03  1.642482  1.039809  1.026084  5  2.0  NaN
2013-01-04 -0.319732  0.618421  0.860000  5  3.0  NaN

In [52]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

# Stats

In [53]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.482398  5  NaN
2013-01-02  0.922567  0.300391  1.469307  5  1.0
2013-01-03  1.642482  1.039809  1.026084  5  2.0
2013-01-04 -0.319732  0.618421  0.860000  5  3.0
2013-01-05 -0.118017 -0.593080  1.106194  5  4.0
2013-01-06  2.468270  0.091436 -1.721132  5  5.0

In [54]:
df.mean()

A    0.765928
B    0.242829
C    0.376343
D    5.000000
F    3.000000
dtype: float64

In [55]:
df.mean(1)

2013-01-01    1.129400
2013-01-02    1.738453
2013-01-03    2.141675
2013-01-04    1.831738
2013-01-05    1.879019
2013-01-06    2.167715
Freq: D, dtype: float64

In [56]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

크기가 다르고 정렬이 필요한 객체로 작업합니다.

pandas는 지정된 차원을 따라 자동으로 broadcast합니다.

In [57]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03  0.642482  0.039809  0.026084  4.0  1.0
2013-01-04 -3.319732 -2.381579 -2.140000  2.0  0.0
2013-01-05 -5.118017 -5.593080 -3.893806  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

# Apply

In [58]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.482398  5  NaN
2013-01-02  0.922567  0.300391  1.469307  5  1.0
2013-01-03  1.642482  1.039809  1.026084  5  2.0
2013-01-04 -0.319732  0.618421  0.860000  5  3.0
2013-01-05 -0.118017 -0.593080  1.106194  5  4.0
2013-01-06  2.468270  0.091436 -1.721132  5  5.0

In [59]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000 -0.482398   5   NaN
2013-01-02  0.922567  0.300391  0.986909  10   1.0
2013-01-03  2.565049  1.340200  2.012993  15   3.0
2013-01-04  2.245317  1.958621  2.872993  20   6.0
2013-01-05  2.127300  1.365541  3.979187  25  10.0
2013-01-06  4.595569  1.456977  2.258056  30  15.0

In [60]:
df.apply(lambda x : x.max() - x.min())

A    2.788002
B    1.632889
C    3.190438
D    0.000000
F    4.000000
dtype: float64

# Histogramming

In [61]:
s = pd.Series(np.random.randint(0,7,size=10))
s

0    1
1    5
2    6
3    1
4    1
5    2
6    3
7    2
8    0
9    3
dtype: int64

In [62]:
s.value_counts()

1    3
3    2
2    2
6    1
5    1
0    1
dtype: int64

# String Methods

In [63]:
s = pd.Series(['A', "B","C","Aaba","Baca",np.nan,"CABA","dog","cat"])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

# Merge(병합)

## Concat

pandas는 Series와 DataFrame 객체를 쉽게 결합할 수 있는 다양한 기능을 제공합니다.

Join, Merge 연산의 경우 index와 관계 대수를 위한 다양한 로직을 제공합니다.

In [64]:
df = pd.DataFrame(np.random.randn(10,4))
df

          0         1         2         3
0 -0.098306 -0.746985 -0.701880 -2.611883
1  0.200382  0.613121 -1.663431  1.856945
2 -0.026380  1.561318  0.814321 -1.753091
3 -0.102520  1.746159 -0.491430  0.371601
4  0.664680 -1.039469  0.060267  0.318090
5  1.835044 -1.598911  2.108820  0.600731
6  0.881198 -1.849662 -2.716672 -0.549661
7 -0.608767  0.487687  1.024959  0.462489
8 -0.203782  0.308219 -1.826508  0.351930
9  0.325343 -0.886928 -0.122492  0.489278

In [65]:
pieces = [df[:3], df[3:7],df[7:]]
pieces

[          0         1         2         3
 0 -0.098306 -0.746985 -0.701880 -2.611883
 1  0.200382  0.613121 -1.663431  1.856945
 2 -0.026380  1.561318  0.814321 -1.753091,
           0         1         2         3
 3 -0.102520  1.746159 -0.491430  0.371601
 4  0.664680 -1.039469  0.060267  0.318090
 5  1.835044 -1.598911  2.108820  0.600731
 6  0.881198 -1.849662 -2.716672 -0.549661,
           0         1         2         3
 7 -0.608767  0.487687  1.024959  0.462489
 8 -0.203782  0.308219 -1.826508  0.351930
 9  0.325343 -0.886928 -0.122492  0.489278]

In [66]:
pd.concat(pieces)

          0         1         2         3
0 -0.098306 -0.746985 -0.701880 -2.611883
1  0.200382  0.613121 -1.663431  1.856945
2 -0.026380  1.561318  0.814321 -1.753091
3 -0.102520  1.746159 -0.491430  0.371601
4  0.664680 -1.039469  0.060267  0.318090
5  1.835044 -1.598911  2.108820  0.600731
6  0.881198 -1.849662 -2.716672 -0.549661
7 -0.608767  0.487687  1.024959  0.462489
8 -0.203782  0.308219 -1.826508  0.351930
9  0.325343 -0.886928 -0.122492  0.489278

## Join

SQL 스타일로 병합이 됩니다.

In [67]:
left = pd.DataFrame({"key" :["foo","foo"], "lval" : [1,2]})
left

   key  lval
0  foo     1
1  foo     2

In [68]:
right = pd.DataFrame({"key" :["foo","foo"], "lval" : [4,5]})
right

   key  lval
0  foo     4
1  foo     5

In [69]:
pd.merge(left, right, on='key')

   key  lval_x  lval_y
0  foo       1       4
1  foo       1       5
2  foo       2       4
3  foo       2       5

다른 예를 보자면

In [70]:
left = pd.DataFrame({"key" : ["foo","bar"], "lval" : [1,2]})
left

   key  lval
0  foo     1
1  bar     2

In [71]:
right = pd.DataFrame({"key" :["foo","bar"], "lval" : [4,5]})
right

   key  lval
0  foo     4
1  bar     5

In [72]:
pd.merge(left, right, on='key')

   key  lval_x  lval_y
0  foo       1       4
1  bar       2       5

# Grouping
'group by' 란 다음 단계 중 하나이상을 포함하는 프로세스를 의미합니다.
- 일부 기준에 따라 데이터를 그룹으로 나눕니다.
- 각 그룹에 독립적으로 기능을 적용합니다.
- 결과를 데이터 구조로 결합합니다.

In [73]:
df = pd.DataFrame(
    {
        "A" : ["foo",'bar','foo','bar','foo','bar','foo','foo'],
        "B" : ["one","one","two","three","two",'two','one','three'],
        "C" : np.random.randn(8),
        "D" : np.random.randn(8)
    }
)
df

     A      B         C         D
0  foo    one -0.566292  0.772156
1  bar    one -0.255388  0.397880
2  foo    two -1.299427  1.289606
3  bar  three  0.324116  0.064916
4  foo    two  0.655182 -0.331326
5  bar    two -0.593039  0.250350
6  foo    one -1.027659 -0.696243
7  foo  three  2.082250  1.286657

그룹으로 결합후에 sum() 함수를 적용합니다.

In [74]:
df.groupby("A").sum()

            C         D
A
bar -0.524311  0.713146
foo -0.155946  2.320850

# Reshaping

## Stack

In [75]:
tuples = list(
    zip(
        *[
          ["bar","bar","baz","baz","foo","foo","qux","qux"],
          ["one","two","one","two","one","two","one",'two'],
        ]
    )
)

index = pd.MultiIndex.from_tuples(tuples, names=['first','second'])
df = pd.DataFrame(np.random.randn(8,2), index=index, columns=["A","B"])
df2 = df[:4]
df2

                     A         B
first second
bar   one    -0.015656  2.689812
      two     1.296150 -0.388182
baz   one     0.321629 -1.098095
      two    -2.049096  0.237268

stack() 메서드는 DataFrame 열의 수준을 압축합니다.

In [76]:
stacked = df2.stack()
stacked

first  second
bar    one     A   -0.015656
               B    2.689812
       two     A    1.296150
               B   -0.388182
baz    one     A    0.321629
               B   -1.098095
       two     A   -2.049096
               B    0.237268
dtype: float64

stacked DataFrame 이나 Series를 역 stack() 한 메서드는 unstack()입니다.

In [77]:
stacked.unstack()

                     A         B
first second
bar   one    -0.015656  2.689812
      two     1.296150 -0.388182
baz   one     0.321629 -1.098095
      two    -2.049096  0.237268

In [78]:
stacked.unstack(1)

second        one       two
first
bar   A -0.015656  1.296150
      B  2.689812 -0.388182
baz   A  0.321629 -2.049096
      B -1.098095  0.237268

In [79]:
stacked.unstack(0)

first          bar       baz
second
one    A -0.015656  0.321629
       B  2.689812 -1.098095
two    A  1.296150 -2.049096
       B -0.388182  0.237268

## Pivot tables

In [80]:
df = pd.DataFrame(
    {
    "A" : ["one", "one","two","three"] * 3,
    "B" : ["A","B","C"] * 4,
    "C" : ["foo","foo","foo","bar","bar","bar"] * 2,
    "D" : np.random.randn(12),
    "E" : np.random.randn(12),
    }
)
df

        A  B    C         D         E
0     one  A  foo -0.816479 -0.336909
1     one  B  foo -1.265004  0.601148
2     two  C  foo -0.372951  0.770964
3   three  A  bar -0.818273  1.746186
4     one  B  bar -0.049606  0.295361
5     one  C  bar -2.260234  1.534516
6     two  A  foo -0.168589  1.674234
7   three  B  foo  0.186862 -1.236255
8     one  C  foo -0.316820 -1.219441
9     one  A  bar -0.555087 -0.886220
10    two  B  bar -1.551717  0.508211
11  three  C  bar -1.172293 -1.210659

In [81]:
pd.pivot_table(df, values="D", index=["A","B"], columns=["C"])

C             bar       foo
A     B
one   A -0.555087 -0.816479
      B -0.049606 -1.265004
      C -2.260234 -0.316820
three A -0.818273       NaN
      B       NaN  0.186862
      C -1.172293       NaN
two   A       NaN -0.168589
      B -1.551717       NaN
      C       NaN -0.372951

# Time series

In [82]:
rng = pd.date_range("1/1/2012", periods=100, freq="S")
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)
ts.resample('5Min').sum()

2012-01-01    28231
Freq: 5T, dtype: int64

In [83]:
rng = pd.date_range("3/6/2012 00:00", periods=5, freq="D")
ts = pd.Series(np.random.randn(len(rng)), rng)
ts

2012-03-06   -0.069506
2012-03-07   -0.918816
2012-03-08    0.890624
2012-03-09    1.993954
2012-03-10   -1.221739
Freq: D, dtype: float64

In [84]:
ts_utc = ts.tz_localize("UTC")
ts_utc

2012-03-06 00:00:00+00:00   -0.069506
2012-03-07 00:00:00+00:00   -0.918816
2012-03-08 00:00:00+00:00    0.890624
2012-03-09 00:00:00+00:00    1.993954
2012-03-10 00:00:00+00:00   -1.221739
Freq: D, dtype: float64

In [85]:
ts_utc.tz_convert("US/Eastern")

2012-03-05 19:00:00-05:00   -0.069506
2012-03-06 19:00:00-05:00   -0.918816
2012-03-07 19:00:00-05:00    0.890624
2012-03-08 19:00:00-05:00    1.993954
2012-03-09 19:00:00-05:00   -1.221739
Freq: D, dtype: float64

In [86]:
rng = pd.date_range("1/1/2012", periods = 5, freq="M")
ts = pd.Series(np.random.randn(len(rng)), index=rng)
ts

2012-01-31    0.360958
2012-02-29   -0.301182
2012-03-31    1.190203
2012-04-30   -0.423574
2012-05-31   -1.636394
Freq: M, dtype: float64

In [87]:
ps = ts.to_period()
ps

2012-01    0.360958
2012-02   -0.301182
2012-03    1.190203
2012-04   -0.423574
2012-05   -1.636394
Freq: M, dtype: float64

In [88]:
ps.to_timestamp()

2012-01-01    0.360958
2012-02-01   -0.301182
2012-03-01    1.190203
2012-04-01   -0.423574
2012-05-01   -1.636394
Freq: MS, dtype: float64

In [89]:
prng = pd.period_range("1990Q1", "2000Q4", freq="Q-NOV")
ts= pd.Series(np.random.randn(len(prng)), prng)
ts.index = (prng.asfreq("M", "e") + 1).asfreq("H", "s") + 9

ts.head()

1990-03-01 09:00   -0.126818
1990-06-01 09:00   -0.844391
1990-09-01 09:00    1.051360
1990-12-01 09:00   -0.681128
1991-03-01 09:00    0.275595
Freq: H, dtype: float64

# Categoricals

In [91]:
df = pd.DataFrame({
    "id" : [1,2,3,4,5,6],
    "raw_grade" : ["a","b","b","a","a","e"]
})

In [93]:
df

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

raw_grade를 범주형 데이터 타입으로 변환합니다.

In [94]:
df['grade'] = df['raw_grade'].astype("category")
df['grade']

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): ['a', 'b', 'e']

카테고리의 이름을 변경합니다.

In [95]:
df['grade'].cat.categories = ['very good','good','very bad']

In [96]:
df['grade']

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (3, object): ['very good', 'good', 'very bad']

범주의 순서를 변경하고, 누락된 범주를 동시에 추가합니다.

In [102]:
df['grade'] = df['grade'].cat.set_categories(
    ['very bad', "bad", "medium", "good", "very good"]
)

df['grade']

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (5, object): ['very bad', 'bad', 'medium', 'good', 'very good']

In [98]:
df

   id raw_grade      grade
0   1         a  very good
1   2         b       good
2   3         b       good
3   4         a  very good
4   5         a  very good
5   6         e   very bad

In [100]:
df.sort_values(by="grade")

   id raw_grade      grade
5   6         e   very bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good

In [101]:
df.groupby('grade').size()

grade
very bad     1
bad          0
medium       0
good         2
very good    3
dtype: int64